---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AllElementsRemovedFromGroup
source: html/cc005f8c-979b-0c18-4d4c-7113e796ac92.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AllElementsRemovedFromGroup Property

Group "[Type Name]" is now empty and will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId AllElementsRemovedFromGroup { get; }
```